TerryFogg/nfNativeVisualStudio/STM32H735G_DK_nanoCLR/AzureRTOS/ST/STM32H735G_DK/nanoCLR/System.Media.PlaySound/cpu_System.Media.Playsound.c
#include <stm32h7xx_hal_dma.h>
//
// Copyright (c) .NET Foundation and Contributors
// Portions Copyright (c) 2021 STMicroelectronics.  All rights reserved.
// See LICENSE file in the project root for full license information.
//


#include "stm32h7xx.h"

/* SAI peripheral configuration defines */
#define AUDIO_SAIx SAI1_Block_B
#define AUDIO_SAIx_CLK_ENABLE() __HAL_RCC_SAI1_CLK_ENABLE()

#define AUDIO_SAIx_FS_GPIO_PORT GPIOF
#define AUDIO_SAIx_FS_AF GPIO_AF6_SAI1
#define AUDIO_SAIx_FS_PIN GPIO_PIN_9
#define AUDIO_SAIx_SCK_GPIO_PORT GPIOF
#define AUDIO_SAIx_SCK_AF GPIO_AF6_SAI1
#define AUDIO_SAIx_SCK_PIN GPIO_PIN_8
#define AUDIO_SAIx_SD_GPIO_PORT GPIOF
#define AUDIO_SAIx_SD_AF GPIO_AF6_SAI1
#define AUDIO_SAIx_SD_PIN GPIO_PIN_6
#define AUDIO_SAIx_MCLK_GPIO_PORT GPIOF
#define AUDIO_SAIx_MCLK_AF GPIO_AF6_SAI1
#define AUDIO_SAIx_MCLK_PIN GPIO_PIN_7

#define AUDIO_SAIx_MCLK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define AUDIO_SAIx_SCK_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define AUDIO_SAIx_FS_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()
#define AUDIO_SAIx_SD_ENABLE() __HAL_RCC_GPIOF_CLK_ENABLE()

#define PLAY_HEADER 0x2C
#define PLAY_BUFF_SIZE 4096
#define AUDIO_I2C_ADDRESS 0x34
#define AUDIO_FREQUENCY_22K 22050U

// ???????????????????
#define AUDIO_FILE_ADDRESS 0x08080000
#define AUDIO_FILE_SIZE (180 * 1024)
// ???????????????????

typedef enum {
  HAL_SAI_STATE_RESET = 0x00U,   /*!< SAI not yet initialized or disabled  */
  HAL_SAI_STATE_READY = 0x01U,   /*!< SAI initialized and ready for use    */
  HAL_SAI_STATE_BUSY = 0x02U,    /*!< SAI internal process is ongoing      */
  HAL_SAI_STATE_BUSY_TX = 0x12U, /*!< Data transmission process is ongoing */
  HAL_SAI_STATE_BUSY_RX = 0x22U, /*!< Data reception process is ongoing    */
} HAL_SAI_StateTypeDef;

/**
 * @brief  SAI Callback prototype
 */
typedef void (*SAIcallback)(void);

/** @defgroup SAI_PDM_Structure_definition SAI PDM Structure definition
 * @brief  SAI PDM Init structure definition
 * @{
 */
typedef struct {
  FunctionalState Activation; /*!< Enable/disable PDM interface */
  uint32_t MicPairsNbr; /*!< Specifies the number of microphone pairs used.
                             This parameter must be a number between Min_Data =
                           1 and Max_Data = 3. */
  uint32_t ClockEnable; /*!< Specifies which clock must be enabled.
                             This parameter can be a values combination of @ref
                           SAI_PDM_ClockEnable */
} SAI_PdmInitTypeDef;
/**
 * @}
 */

/** @defgroup SAI_Init_Structure_definition SAI Init Structure definition
 * @brief  SAI Init Structure definition
 * @{
 */
typedef struct {
  uint32_t
      AudioMode; /*!< Specifies the SAI Block audio Mode.
                      This parameter can be a value of @ref SAI_Block_Mode */

  uint32_t Synchro; /*!< Specifies SAI Block synchronization
                         This parameter can be a value of @ref
                       SAI_Block_Synchronization */

  uint32_t SynchroExt; /*!< Specifies SAI external output synchronization, this
                          setup is common for BlockA and BlockB This parameter
                          can be a value of @ref SAI_Block_SyncExt
                            @note If both audio blocks of same SAI are used,
                          this parameter has to be set to the same value for
                          each audio block */

  uint32_t MckOutput; /*!< Specifies whether master clock output will be
                         generated or not. This parameter can be a value of @ref
                         SAI_Block_MckOutput
                           @note This feature is only available on STM32H7xx
                         Rev.B and above */

  uint32_t
      OutputDrive; /*!< Specifies when SAI Block outputs are driven.
                        This parameter can be a value of @ref
                      SAI_Block_Output_Drive
                        @note This value has to be set before enabling the audio
                      block but after the audio block configuration. */

  uint32_t
      NoDivider; /*!< Specifies whether master clock will be divided or not.
                      This parameter can be a value of @ref SAI_Block_NoDivider
                      @note If bit NODIV in the SAI_xCR1 register is cleared,
                    the frame length should be aligned to a number equal to a
                    power of 2, from 8 to 256. If bit NODIV in the SAI_xCR1
                    register is set, the frame length can take any of the values
                    from 8 to 256.
                      @note The NODIV bit is the same as NOMCK bit in STM32H7xx
                    rev.Y */

  uint32_t FIFOThreshold; /*!< Specifies SAI Block FIFO threshold.
                               This parameter can be a value of @ref
                             SAI_Block_Fifo_Threshold */

  uint32_t AudioFrequency; /*!< Specifies the audio frequency sampling.
                                This parameter can be a value of @ref
                              SAI_Audio_Frequency */

  uint32_t Mckdiv; /*!< Specifies the master clock divider.
                        This parameter must be a number between Min_Data = 0 and
                      Max_Data = 63.
                        @note This parameter is used only if AudioFrequency is
                      set to SAI_AUDIO_FREQUENCY_MCKDIV otherwise it is
                      internally computed. */

  uint32_t MckOverSampling; /*!< Specifies the master clock oversampling.
                                 This parameter can be a value of @ref
                               SAI_Block_Mck_OverSampling */

  uint32_t MonoStereoMode; /*!< Specifies if the mono or stereo mode is
                              selected. This parameter can be a value of @ref
                              SAI_Mono_Stereo_Mode */

  uint32_t CompandingMode; /*!< Specifies the companding mode type.
                                This parameter can be a value of @ref
                              SAI_Block_Companding_Mode */

  uint32_t TriState; /*!< Specifies the companding mode type.
                          This parameter can be a value of @ref
                        SAI_TRIState_Management */

  SAI_PdmInitTypeDef PdmInit; /*!< Specifies the PDM configuration. */

  /* This part of the structure is automatically filled if your are using the
     high level initialisation function HAL_SAI_InitProtocol */

  uint32_t
      Protocol; /*!< Specifies the SAI Block protocol.
                     This parameter can be a value of @ref SAI_Block_Protocol */

  uint32_t DataSize; /*!< Specifies the SAI Block data size.
                          This parameter can be a value of @ref
                        SAI_Block_Data_Size */

