TerryFogg/nfNativeVisualStudio/STM32H735G_DK_nanoCLR/AzureRTOS/ST/STM32H735G_DK/nanoCLR/System.Media.PlaySound/cpu_System.Media.Playsound.c
  uint32_t FirstBit; /*!< Specifies whether data transfers start from MSB or LSB
                        bit. This parameter can be a value of @ref
                        SAI_Block_MSB_LSB_transmission */

  uint32_t ClockStrobing; /*!< Specifies the SAI Block clock strobing edge
                             sensitivity. This parameter can be a value of @ref
                             SAI_Block_Clock_Strobing */
} SAI_InitTypeDef;
/**
 * @}
 */

/** @defgroup SAI_Frame_Structure_definition SAI Frame Structure definition
 * @brief  SAI Frame Init structure definition
 * @note   For SPDIF and AC97 protocol, these parameters are not used (set by
 * hardware).
 * @{
 */
typedef struct {

  uint32_t FrameLength; /*!< Specifies the Frame length, the number of SCK
                           clocks for each audio frame. This parameter must be a
                           number between Min_Data = 8 and Max_Data = 256.
                             @note If master clock MCLK_x pin is declared as an
                           output, the frame length should be aligned to a
                           number equal to power of 2 in order to keep in an
                           audio frame, an integer number of MCLK pulses by bit
                           Clock. */

  uint32_t
      ActiveFrameLength; /*!< Specifies the Frame synchronization active level
                            length. This Parameter specifies the length in
                            number of bit clock (SCK + 1) of the active level of
                            FS signal in audio frame. This parameter must be a
                            number between Min_Data = 1 and Max_Data = 128 */

  uint32_t FSDefinition; /*!< Specifies the Frame synchronization definition.
                              This parameter can be a value of @ref
                            SAI_Block_FS_Definition */

  uint32_t FSPolarity; /*!< Specifies the Frame synchronization Polarity.
                            This parameter can be a value of @ref
                          SAI_Block_FS_Polarity */

  uint32_t FSOffset; /*!< Specifies the Frame synchronization Offset.
                          This parameter can be a value of @ref
                        SAI_Block_FS_Offset */

} SAI_FrameInitTypeDef;
/**
 * @}
 */

/** @defgroup SAI_Slot_Structure_definition SAI Slot Structure definition
 * @brief   SAI Block Slot Init Structure definition
 * @note    For SPDIF protocol, these parameters are not used (set by hardware).
 * @note    For AC97 protocol, only SlotActive parameter is used (the others are
 * set by hardware).
 * @{
 */
typedef struct {
  uint32_t FirstBitOffset; /*!< Specifies the position of first data transfer
                              bit in the slot. This parameter must be a number
                              between Min_Data = 0 and Max_Data = 24 */

  uint32_t SlotSize; /*!< Specifies the Slot Size.
                          This parameter can be a value of @ref
                        SAI_Block_Slot_Size */

  uint32_t SlotNumber; /*!< Specifies the number of slot in the audio frame.
                            This parameter must be a number between Min_Data = 1
                          and Max_Data = 16 */

  uint32_t SlotActive; /*!< Specifies the slots in audio frame that will be
                          activated. This parameter can be a value of @ref
                          SAI_Block_Slot_Active */
} SAI_SlotInitTypeDef;
/**
 * @}
 */

/** @defgroup SAI_Handle_Structure_definition SAI Handle Structure definition
 * @brief  SAI handle Structure definition
 * @{
 */
typedef struct __SAI_HandleTypeDef {
  SAI_Block_TypeDef *Instance; /*!< SAI Blockx registers base address */

  SAI_InitTypeDef Init; /*!< SAI communication parameters */

  SAI_FrameInitTypeDef FrameInit; /*!< SAI Frame configuration parameters */

  SAI_SlotInitTypeDef SlotInit; /*!< SAI Slot configuration parameters */

  uint8_t *pBuffPtr; /*!< Pointer to SAI transfer Buffer */

  uint16_t XferSize; /*!< SAI transfer size */

  uint16_t XferCount; /*!< SAI transfer counter */

  DMA_HandleTypeDef *hdmatx; /*!< SAI Tx DMA handle parameters */

  DMA_HandleTypeDef *hdmarx; /*!< SAI Rx DMA handle parameters */

  SAIcallback mutecallback; /*!< SAI mute callback */

  void (*InterruptServiceRoutine)(
      struct __SAI_HandleTypeDef *hsai); /* function pointer for IRQ handler */

  HAL_LockTypeDef Lock; /*!< SAI locking object */

  __IO HAL_SAI_StateTypeDef State; /*!< SAI communication state */

  __IO uint32_t ErrorCode; /*!< SAI Error code */

} SAI_HandleTypeDef;
/**
 * @}
 */

/**
 * @}
 */

/* Exported constants --------------------------------------------------------*/
/** @defgroup SAI_Exported_Constants SAI Exported Constants
 * @{
 */

/** @defgroup SAI_Error_Code SAI Error Code
 * @{
 */
#define HAL_SAI_ERROR_NONE 0x00000000U /*!< No error */
#define HAL_SAI_ERROR_OVR 0x00000001U  /*!< Overrun Error */
#define HAL_SAI_ERROR_UDR 0x00000002U  /*!< Underrun error */
#define HAL_SAI_ERROR_AFSDET                                                   \
  0x00000004U /*!< Anticipated Frame synchronisation detection */
#define HAL_SAI_ERROR_LFSDET                                                   \
  0x00000008U /*!< Late Frame synchronisation detection */
#define HAL_SAI_ERROR_CNREADY 0x00000010U /*!< codec not ready */
#define HAL_SAI_ERROR_WCKCFG 0x00000020U  /*!< Wrong clock configuration */
#define HAL_SAI_ERROR_TIMEOUT 0x00000040U /*!< Timeout error */
#define HAL_SAI_ERROR_DMA 0x00000080U     /*!< DMA error */
#if (USE_HAL_SAI_REGISTER_CALLBACKS == 1)
#define HAL_SAI_ERROR_INVALID_CALLBACK                                         \
  0x00000100U /*!< Invalid callback error */
#endif
/**
 * @}
 */

/** @defgroup SAI_Block_SyncExt SAI External synchronisation
 * @{
 */
#define SAI_SYNCEXT_DISABLE 0U
#define SAI_SYNCEXT_OUTBLOCKA_ENABLE 1U
#define SAI_SYNCEXT_OUTBLOCKB_ENABLE 2U
/**
 * @}
 */

/** @defgroup SAI_Block_MckOutput SAI Block Master Clock Output
 * @{
 */
#define SAI_MCK_OUTPUT_DISABLE 0x00000000U
#define SAI_MCK_OUTPUT_ENABLE SAI_xCR1_MCKEN
/**
 * @}
 */

/** @defgroup SAI_Protocol SAI Supported protocol
 * @{
 */
#define SAI_I2S_STANDARD 0U
#define SAI_I2S_MSBJUSTIFIED 1U
#define SAI_I2S_LSBJUSTIFIED 2U
#define SAI_PCM_LONG 3U
#define SAI_PCM_SHORT 4U
/**
 * @}
 */

/** @defgroup SAI_Protocol_DataSize SAI protocol data size
 * @{
 */
#define SAI_PROTOCOL_DATASIZE_16BIT 0U
#define SAI_PROTOCOL_DATASIZE_16BITEXTENDED 1U
#define SAI_PROTOCOL_DATASIZE_24BIT 2U
#define SAI_PROTOCOL_DATASIZE_32BIT 3U
/**
 * @}
 */

/** @defgroup SAI_Audio_Frequency SAI Audio Frequency
 * @{
 */
#define SAI_AUDIO_FREQUENCY_192K 192000U
#define SAI_AUDIO_FREQUENCY_96K 96000U
#define SAI_AUDIO_FREQUENCY_48K 48000U
#define SAI_AUDIO_FREQUENCY_44K 44100U
#define SAI_AUDIO_FREQUENCY_32K 32000U
#define SAI_AUDIO_FREQUENCY_22K 22050U
#define SAI_AUDIO_FREQUENCY_16K 16000U
#define SAI_AUDIO_FREQUENCY_11K 11025U
#define SAI_AUDIO_FREQUENCY_8K 8000U
#define SAI_AUDIO_FREQUENCY_MCKDIV 0U
/**
 * @}
 */

/** @defgroup SAI_Block_Mck_OverSampling SAI Block Master Clock OverSampling
 * @{
 */
#define SAI_MCK_OVERSAMPLING_DISABLE 0x00000000U
#define SAI_MCK_OVERSAMPLING_ENABLE SAI_xCR1_OSR
/**
 * @}
 */

/** @defgroup SAI_PDM_ClockEnable SAI PDM Clock Enable
 * @{
 */
#define SAI_PDM_CLOCK1_ENABLE SAI_PDMCR_CKEN1
#define SAI_PDM_CLOCK2_ENABLE SAI_PDMCR_CKEN2
/**
 * @}
 */

/** @defgroup SAI_Block_Mode SAI Block Mode
 * @{
 */
#define SAI_MODEMASTER_TX 0x00000000U
#define SAI_MODEMASTER_RX SAI_xCR1_MODE_0
#define SAI_MODESLAVE_TX SAI_xCR1_MODE_1
#define SAI_MODESLAVE_RX (SAI_xCR1_MODE_1 | SAI_xCR1_MODE_0)

/**
 * @}
 */

/** @defgroup SAI_Block_Protocol SAI Block Protocol
 * @{
 */
#define SAI_FREE_PROTOCOL 0x00000000U
#define SAI_SPDIF_PROTOCOL SAI_xCR1_PRTCFG_0
#define SAI_AC97_PROTOCOL SAI_xCR1_PRTCFG_1
/**
 * @}
 */

/** @defgroup SAI_Block_Data_Size SAI Block Data Size
 * @{
 */
#define SAI_DATASIZE_8 SAI_xCR1_DS_1
#define SAI_DATASIZE_10 (SAI_xCR1_DS_1 | SAI_xCR1_DS_0)
#define SAI_DATASIZE_16 SAI_xCR1_DS_2
#define SAI_DATASIZE_20 (SAI_xCR1_DS_2 | SAI_xCR1_DS_0)
#define SAI_DATASIZE_24 (SAI_xCR1_DS_2 | SAI_xCR1_DS_1)
#define SAI_DATASIZE_32 (SAI_xCR1_DS_2 | SAI_xCR1_DS_1 | SAI_xCR1_DS_0)
/**
 * @}
 */

/** @defgroup SAI_Block_MSB_LSB_transmission SAI Block MSB LSB transmission
 * @{
 */
#define SAI_FIRSTBIT_MSB 0x00000000U
#define SAI_FIRSTBIT_LSB SAI_xCR1_LSBFIRST
/**
 * @}
 */

