TerryFogg/nfNativeVisualStudio/STM32H735G_DK_nanoCLR/AzureRTOS/ST/STM32H735G_DK/nanoCLR/System.Media.PlaySound/cpu_System.Media.Playsound.c
/** @defgroup SAI_Block_Clock_Strobing SAI Block Clock Strobing
 * @{
 */
#define SAI_CLOCKSTROBING_FALLINGEDGE 0U
#define SAI_CLOCKSTROBING_RISINGEDGE 1U
/**
 * @}
 */

/** @defgroup SAI_Block_Synchronization SAI Block Synchronization
 * @{
 */
#define SAI_ASYNCHRONOUS 0U /*!< Asynchronous */
#define SAI_SYNCHRONOUS 1U  /*!< Synchronous with other block of same SAI */
#define SAI_SYNCHRONOUS_EXT_SAI1 2U /*!< Synchronous with other SAI, SAI1 */
#define SAI_SYNCHRONOUS_EXT_SAI4 5U /*!< Synchronous with other SAI, SAI4 */
/**
 * @}
 */

/** @defgroup SAI_Block_Output_Drive SAI Block Output Drive
 * @{
 */
#define SAI_OUTPUTDRIVE_DISABLE 0x00000000U
#define SAI_OUTPUTDRIVE_ENABLE SAI_xCR1_OUTDRIV
/**
 * @}
 */

/** @defgroup SAI_Block_NoDivider SAI Block NoDivider
 * @{
 */
#define SAI_MASTERDIVIDER_ENABLE 0x00000000U
#define SAI_MASTERDIVIDER_DISABLE SAI_xCR1_NODIV
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Definition SAI Block FS Definition
 * @{
 */
#define SAI_FS_STARTFRAME 0x00000000U
#define SAI_FS_CHANNEL_IDENTIFICATION SAI_xFRCR_FSDEF
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Polarity SAI Block FS Polarity
 * @{
 */
#define SAI_FS_ACTIVE_LOW 0x00000000U
#define SAI_FS_ACTIVE_HIGH SAI_xFRCR_FSPOL
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Offset SAI Block FS Offset
 * @{
 */
#define SAI_FS_FIRSTBIT 0x00000000U
#define SAI_FS_BEFOREFIRSTBIT SAI_xFRCR_FSOFF
/**
 * @}
 */

/** @defgroup SAI_Block_Slot_Size SAI Block Slot Size
 * @{
 */
#define SAI_SLOTSIZE_DATASIZE 0x00000000U
#define SAI_SLOTSIZE_16B SAI_xSLOTR_SLOTSZ_0
#define SAI_SLOTSIZE_32B SAI_xSLOTR_SLOTSZ_1
/**
 * @}
 */

/** @defgroup SAI_Block_Slot_Active SAI Block Slot Active
 * @{
 */
#define SAI_SLOT_NOTACTIVE 0x00000000U
#define SAI_SLOTACTIVE_0 0x00000001U
#define SAI_SLOTACTIVE_1 0x00000002U
#define SAI_SLOTACTIVE_2 0x00000004U
#define SAI_SLOTACTIVE_3 0x00000008U
#define SAI_SLOTACTIVE_4 0x00000010U
#define SAI_SLOTACTIVE_5 0x00000020U
#define SAI_SLOTACTIVE_6 0x00000040U
#define SAI_SLOTACTIVE_7 0x00000080U
#define SAI_SLOTACTIVE_8 0x00000100U
#define SAI_SLOTACTIVE_9 0x00000200U
#define SAI_SLOTACTIVE_10 0x00000400U
#define SAI_SLOTACTIVE_11 0x00000800U
#define SAI_SLOTACTIVE_12 0x00001000U
#define SAI_SLOTACTIVE_13 0x00002000U
#define SAI_SLOTACTIVE_14 0x00004000U
#define SAI_SLOTACTIVE_15 0x00008000U
#define SAI_SLOTACTIVE_ALL 0x0000FFFFU
/**
 * @}
 */

/** @defgroup SAI_Mono_Stereo_Mode SAI Mono Stereo Mode
 * @{
 */
#define SAI_STEREOMODE 0x00000000U
#define SAI_MONOMODE SAI_xCR1_MONO
/**
 * @}
 */

/** @defgroup SAI_TRIState_Management SAI TRIState Management
 * @{
 */
#define SAI_OUTPUT_NOTRELEASED 0x00000000U
#define SAI_OUTPUT_RELEASED SAI_xCR2_TRIS
/**
 * @}
 */

/** @defgroup SAI_Block_Fifo_Threshold SAI Block Fifo Threshold
 * @{
 */
#define SAI_FIFOTHRESHOLD_EMPTY 0x00000000U
#define SAI_FIFOTHRESHOLD_1QF SAI_xCR2_FTH_0
#define SAI_FIFOTHRESHOLD_HF SAI_xCR2_FTH_1
#define SAI_FIFOTHRESHOLD_3QF (SAI_xCR2_FTH_1 | SAI_xCR2_FTH_0)
#define SAI_FIFOTHRESHOLD_FULL SAI_xCR2_FTH_2
/**
 * @}
 */

/** @defgroup SAI_Block_Companding_Mode SAI Block Companding Mode
 * @{
 */
#define SAI_NOCOMPANDING 0x00000000U
#define SAI_ULAW_1CPL_COMPANDING SAI_xCR2_COMP_1
#define SAI_ALAW_1CPL_COMPANDING (SAI_xCR2_COMP_1 | SAI_xCR2_COMP_0)
#define SAI_ULAW_2CPL_COMPANDING (SAI_xCR2_COMP_1 | SAI_xCR2_CPL)
#define SAI_ALAW_2CPL_COMPANDING                                               \
  (SAI_xCR2_COMP_1 | SAI_xCR2_COMP_0 | SAI_xCR2_CPL)
/**
 * @}
 */

/** @defgroup SAI_Block_Mute_Value SAI Block Mute Value
 * @{
 */
#define SAI_ZERO_VALUE 0x00000000U
#define SAI_LAST_SENT_VALUE SAI_xCR2_MUTEVAL
/**
 * @}
 */

/** @defgroup SAI_Block_Interrupts_Definition SAI Block Interrupts Definition
 * @{
 */
#define SAI_IT_OVRUDR SAI_xIMR_OVRUDRIE
#define SAI_IT_MUTEDET SAI_xIMR_MUTEDETIE
#define SAI_IT_WCKCFG SAI_xIMR_WCKCFGIE
#define SAI_IT_FREQ SAI_xIMR_FREQIE
#define SAI_IT_CNRDY SAI_xIMR_CNRDYIE
#define SAI_IT_AFSDET SAI_xIMR_AFSDETIE
#define SAI_IT_LFSDET SAI_xIMR_LFSDETIE
/**
 * @}
 */

/** @defgroup SAI_Block_Flags_Definition  SAI Block Flags Definition
 * @{
 */
#define SAI_FLAG_OVRUDR SAI_xSR_OVRUDR
#define SAI_FLAG_MUTEDET SAI_xSR_MUTEDET
#define SAI_FLAG_WCKCFG SAI_xSR_WCKCFG
#define SAI_FLAG_FREQ SAI_xSR_FREQ
#define SAI_FLAG_CNRDY SAI_xSR_CNRDY
#define SAI_FLAG_AFSDET SAI_xSR_AFSDET
#define SAI_FLAG_LFSDET SAI_xSR_LFSDET
/**
 * @}
 */

/** @defgroup SAI_Block_Fifo_Status_Level   SAI Block Fifo Status Level
 * @{
 */
#define SAI_FIFOSTATUS_EMPTY 0x00000000U
#define SAI_FIFOSTATUS_LESS1QUARTERFULL 0x00010000U
#define SAI_FIFOSTATUS_1QUARTERFULL 0x00020000U
#define SAI_FIFOSTATUS_HALFFULL 0x00030000U
#define SAI_FIFOSTATUS_3QUARTERFULL 0x00040000U
#define SAI_FIFOSTATUS_FULL 0x00050000U
/**
 * @}
 */

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SAI_Exported_Macros SAI Exported Macros
 * @brief macros to handle interrupts and specific configurations
 * @{
 */

/** @brief Reset SAI handle state.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @retval None
 */
#define __HAL_SAI_RESET_HANDLE_STATE(__HANDLE__)                               \
  ((__HANDLE__)->State = HAL_SAI_STATE_RESET)

/** @brief  Enable the specified SAI interrupts.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __INTERRUPT__ specifies the interrupt source to enable or disable.
 *         This parameter can be one of the following values:
 *            @arg SAI_IT_OVRUDR: Overrun underrun interrupt enable
 *            @arg SAI_IT_MUTEDET: Mute detection interrupt enable
 *            @arg SAI_IT_WCKCFG: Wrong Clock Configuration interrupt enable
 *            @arg SAI_IT_FREQ: FIFO request interrupt enable
 *            @arg SAI_IT_CNRDY: Codec not ready interrupt enable
 *            @arg SAI_IT_AFSDET: Anticipated frame synchronization detection
 * interrupt enable
 *            @arg SAI_IT_LFSDET: Late frame synchronization detection interrupt
 * enable
 * @retval None
 */
#define __HAL_SAI_ENABLE_IT(__HANDLE__, __INTERRUPT__)                         \
  ((__HANDLE__)->Instance->IMR |= (__INTERRUPT__))

/** @brief  Disable the specified SAI interrupts.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __INTERRUPT__ specifies the interrupt source to enable or disable.
 *         This parameter can be one of the following values:
 *            @arg SAI_IT_OVRUDR: Overrun underrun interrupt enable
 *            @arg SAI_IT_MUTEDET: Mute detection interrupt enable
 *            @arg SAI_IT_WCKCFG: Wrong Clock Configuration interrupt enable
 *            @arg SAI_IT_FREQ: FIFO request interrupt enable
 *            @arg SAI_IT_CNRDY: Codec not ready interrupt enable
 *            @arg SAI_IT_AFSDET: Anticipated frame synchronization detection
 * interrupt enable
 *            @arg SAI_IT_LFSDET: Late frame synchronization detection interrupt
 * enable
 * @retval None
 */
#define __HAL_SAI_DISABLE_IT(__HANDLE__, __INTERRUPT__)                        \
  ((__HANDLE__)->Instance->IMR &= (~(__INTERRUPT__)))

/** @brief  Check whether the specified SAI interrupt source is enabled or not.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __INTERRUPT__ specifies the SAI interrupt source to check.
 *         This parameter can be one of the following values:
 *            @arg SAI_IT_OVRUDR: Overrun underrun interrupt enable
 *            @arg SAI_IT_MUTEDET: Mute detection interrupt enable
 *            @arg SAI_IT_WCKCFG: Wrong Clock Configuration interrupt enable
 *            @arg SAI_IT_FREQ: FIFO request interrupt enable
 *            @arg SAI_IT_CNRDY: Codec not ready interrupt enable
 *            @arg SAI_IT_AFSDET: Anticipated frame synchronization detection
 * interrupt enable
 *            @arg SAI_IT_LFSDET: Late frame synchronization detection interrupt
 * enable
 * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
 */
#define __HAL_SAI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)                     \
  ((((__HANDLE__)->Instance->IMR & (__INTERRUPT__)) == (__INTERRUPT__))        \
       ? SET                                                                   \
       : RESET)

/** @brief  Check whether the specified SAI flag is set or not.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __FLAG__ specifies the flag to check.
 *         This parameter can be one of the following values:
 *            @arg SAI_FLAG_OVRUDR: Overrun underrun flag.
 *            @arg SAI_FLAG_MUTEDET: Mute detection flag.
 *            @arg SAI_FLAG_WCKCFG: Wrong Clock Configuration flag.
 *            @arg SAI_FLAG_FREQ: FIFO request flag.
 *            @arg SAI_FLAG_CNRDY: Codec not ready flag.
 *            @arg SAI_FLAG_AFSDET: Anticipated frame synchronization detection
 * flag.
 *            @arg SAI_FLAG_LFSDET: Late frame synchronization detection flag.
 * @retval The new state of __FLAG__ (TRUE or FALSE).
 */
#define __HAL_SAI_GET_FLAG(__HANDLE__, __FLAG__)                               \
  ((((__HANDLE__)->Instance->SR) & (__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified SAI pending flag.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __FLAG__ specifies the flag to check.
 *          This parameter can be any combination of the following values:
 *            @arg SAI_FLAG_OVRUDR: Clear Overrun underrun
 *            @arg SAI_FLAG_MUTEDET: Clear Mute detection
 *            @arg SAI_FLAG_WCKCFG: Clear Wrong Clock Configuration
 *            @arg SAI_FLAG_FREQ: Clear FIFO request
 *            @arg SAI_FLAG_CNRDY: Clear Codec not ready
 *            @arg SAI_FLAG_AFSDET: Clear Anticipated frame synchronization
 * detection
 *            @arg SAI_FLAG_LFSDET: Clear Late frame synchronization detection
 *
 * @retval None
 */
#define __HAL_SAI_CLEAR_FLAG(__HANDLE__, __FLAG__)                             \
  ((__HANDLE__)->Instance->CLRFR = (__FLAG__))

