TerryFogg/nfNativeVisualStudio/STM32H735G_DK_nanoCLR/AzureRTOS/ST/STM32H735G_DK/nanoCLR/System.Media.PlaySound/cpu_System.Media.Playsound.c
/** @brief  Enable SAI.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @retval None
 */
#define __HAL_SAI_ENABLE(__HANDLE__)                                           \
  ((__HANDLE__)->Instance->CR1 |= SAI_xCR1_SAIEN)

/** @brief  Disable SAI.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @retval None
 */
#define __HAL_SAI_DISABLE(__HANDLE__)                                          \
  ((__HANDLE__)->Instance->CR1 &= ~SAI_xCR1_SAIEN)

/**
 * @}
 */

/* Include SAI HAL Extension module */
#include "stm32h7xx_hal_sai_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup SAI_Exported_Functions
 * @{
 */

/* Initialization/de-initialization functions  ********************************/
/** @addtogroup SAI_Exported_Functions_Group1
 * @{
 */
HAL_StatusTypeDef HAL_SAI_InitProtocol(SAI_HandleTypeDef *hsai,
                                       uint32_t protocol, uint32_t datasize,
                                       uint32_t nbslot);
HAL_StatusTypeDef HAL_SAI_Init(SAI_HandleTypeDef *hsai);
HAL_StatusTypeDef HAL_SAI_DeInit(SAI_HandleTypeDef *hsai);
void HAL_SAI_MspInit(SAI_HandleTypeDef *hsai);
void HAL_SAI_MspDeInit(SAI_HandleTypeDef *hsai);

/* I/O operation functions  ***************************************************/
/** @addtogroup SAI_Exported_Functions_Group2
 * @{
 */
/* Blocking mode: Polling */
HAL_StatusTypeDef HAL_SAI_Transmit(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                   uint16_t Size, uint32_t Timeout);
HAL_StatusTypeDef HAL_SAI_Receive(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                  uint16_t Size, uint32_t Timeout);

/* Non-Blocking mode: Interrupt */
HAL_StatusTypeDef HAL_SAI_Transmit_IT(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                      uint16_t Size);
HAL_StatusTypeDef HAL_SAI_Receive_IT(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                     uint16_t Size);

/* Non-Blocking mode: DMA */
HAL_StatusTypeDef HAL_SAI_Transmit_DMA(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                       uint16_t Size);
HAL_StatusTypeDef HAL_SAI_Receive_DMA(SAI_HandleTypeDef *hsai, uint8_t *pData,
                                      uint16_t Size);
HAL_StatusTypeDef HAL_SAI_DMAPause(SAI_HandleTypeDef *hsai);
HAL_StatusTypeDef HAL_SAI_DMAResume(SAI_HandleTypeDef *hsai);
HAL_StatusTypeDef HAL_SAI_DMAStop(SAI_HandleTypeDef *hsai);

/* Abort function */
HAL_StatusTypeDef HAL_SAI_Abort(SAI_HandleTypeDef *hsai);

/* Mute management */
HAL_StatusTypeDef HAL_SAI_EnableTxMuteMode(SAI_HandleTypeDef *hsai,
                                           uint16_t val);
HAL_StatusTypeDef HAL_SAI_DisableTxMuteMode(SAI_HandleTypeDef *hsai);
HAL_StatusTypeDef HAL_SAI_EnableRxMuteMode(SAI_HandleTypeDef *hsai,
                                           SAIcallback callback,
                                           uint16_t counter);
HAL_StatusTypeDef HAL_SAI_DisableRxMuteMode(SAI_HandleTypeDef *hsai);

/* SAI IRQHandler and Callbacks used in non blocking modes (Interrupt and DMA)
 */
void HAL_SAI_IRQHandler(SAI_HandleTypeDef *hsai);
void HAL_SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai);
void HAL_SAI_TxCpltCallback(SAI_HandleTypeDef *hsai);
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai);
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai);
void HAL_SAI_ErrorCallback(SAI_HandleTypeDef *hsai);
/**
 * @}
 */

/** @addtogroup SAI_Exported_Functions_Group3
 * @{
 */
/* Peripheral State functions  ************************************************/
HAL_SAI_StateTypeDef HAL_SAI_GetState(SAI_HandleTypeDef *hsai);
uint32_t HAL_SAI_GetError(SAI_HandleTypeDef *hsai);
/**
 * @}
 */

/**
 * @}
 */

/* Private macros ------------------------------------------------------------*/
/** @defgroup SAI_Private_Macros SAI Private Macros
 * @{
 */
#define IS_SAI_BLOCK_SYNCEXT(STATE)                                            \
  (((STATE) == SAI_SYNCEXT_DISABLE) ||                                         \
   ((STATE) == SAI_SYNCEXT_OUTBLOCKA_ENABLE) ||                                \
   ((STATE) == SAI_SYNCEXT_OUTBLOCKB_ENABLE))

#define IS_SAI_SUPPORTED_PROTOCOL(PROTOCOL)                                    \
  (((PROTOCOL) == SAI_I2S_STANDARD) || ((PROTOCOL) == SAI_I2S_MSBJUSTIFIED) || \
   ((PROTOCOL) == SAI_I2S_LSBJUSTIFIED) || ((PROTOCOL) == SAI_PCM_LONG) ||     \
   ((PROTOCOL) == SAI_PCM_SHORT))

#define IS_SAI_PROTOCOL_DATASIZE(DATASIZE)                                     \
  (((DATASIZE) == SAI_PROTOCOL_DATASIZE_16BIT) ||                              \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_16BITEXTENDED) ||                      \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_24BIT) ||                              \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_32BIT))

#define IS_SAI_AUDIO_FREQUENCY(AUDIO)                                          \
  (((AUDIO) == SAI_AUDIO_FREQUENCY_192K) ||                                    \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_96K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_48K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_44K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_32K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_22K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_16K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_11K) ||                                     \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_8K) ||                                      \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_MCKDIV))

#define IS_SAI_BLOCK_MCK_OVERSAMPLING(VALUE)                                   \
  (((VALUE) == SAI_MCK_OVERSAMPLING_DISABLE) ||                                \
   ((VALUE) == SAI_MCK_OVERSAMPLING_ENABLE))

#define IS_SAI_PDM_MIC_PAIRS_NUMBER(VALUE) ((1U <= (VALUE)) && ((VALUE) <= 3U))

#define IS_SAI_PDM_CLOCK_ENABLE(CLOCK)                                         \
  (((CLOCK) != 0U) &&                                                          \
   (((CLOCK) & ~(SAI_PDM_CLOCK1_ENABLE | SAI_PDM_CLOCK2_ENABLE)) == 0U))

#define IS_SAI_BLOCK_MODE(MODE)                                                \
  (((MODE) == SAI_MODEMASTER_TX) || ((MODE) == SAI_MODEMASTER_RX) ||           \
   ((MODE) == SAI_MODESLAVE_TX) || ((MODE) == SAI_MODESLAVE_RX))

#define IS_SAI_BLOCK_PROTOCOL(PROTOCOL)                                        \
  (((PROTOCOL) == SAI_FREE_PROTOCOL) || ((PROTOCOL) == SAI_AC97_PROTOCOL) ||   \
   ((PROTOCOL) == SAI_SPDIF_PROTOCOL))

#define IS_SAI_BLOCK_DATASIZE(DATASIZE)                                        \
  (((DATASIZE) == SAI_DATASIZE_8) || ((DATASIZE) == SAI_DATASIZE_10) ||        \
   ((DATASIZE) == SAI_DATASIZE_16) || ((DATASIZE) == SAI_DATASIZE_20) ||       \
   ((DATASIZE) == SAI_DATASIZE_24) || ((DATASIZE) == SAI_DATASIZE_32))

#define IS_SAI_BLOCK_FIRST_BIT(BIT)                                            \
  (((BIT) == SAI_FIRSTBIT_MSB) || ((BIT) == SAI_FIRSTBIT_LSB))

#define IS_SAI_BLOCK_CLOCK_STROBING(CLOCK)                                     \
  (((CLOCK) == SAI_CLOCKSTROBING_FALLINGEDGE) ||                               \
   ((CLOCK) == SAI_CLOCKSTROBING_RISINGEDGE))
#define IS_SAI_BLOCK_SYNCHRO(SYNCHRO)                                          \
  (((SYNCHRO) == SAI_ASYNCHRONOUS) || ((SYNCHRO) == SAI_SYNCHRONOUS) ||        \
   ((SYNCHRO) == SAI_SYNCHRONOUS_EXT_SAI1) ||                                  \
   ((SYNCHRO) == SAI_SYNCHRONOUS_EXT_SAI4))

#define IS_SAI_BLOCK_MCK_OUTPUT(VALUE)                                         \
  (((VALUE) == SAI_MCK_OUTPUT_ENABLE) || ((VALUE) == SAI_MCK_OUTPUT_DISABLE))

