TerryFogg/nfNativeVisualStudio/STM32H735G_DK_nanoCLR/AzureRTOS/ST/STM32H735G_DK/nanoCLR/System.Media.PlaySound/cpu_System.Media.Playsound.c
#define IS_SAI_BLOCK_OUTPUT_DRIVE(DRIVE)                                       \
  (((DRIVE) == SAI_OUTPUTDRIVE_DISABLE) || ((DRIVE) == SAI_OUTPUTDRIVE_ENABLE))

#define IS_SAI_BLOCK_NODIVIDER(NODIVIDER)                                      \
  (((NODIVIDER) == SAI_MASTERDIVIDER_ENABLE) ||                                \
   ((NODIVIDER) == SAI_MASTERDIVIDER_DISABLE))

#define IS_SAI_BLOCK_MUTE_COUNTER(COUNTER) ((COUNTER) <= 63U)

#define IS_SAI_BLOCK_MUTE_VALUE(VALUE)                                         \
  (((VALUE) == SAI_ZERO_VALUE) || ((VALUE) == SAI_LAST_SENT_VALUE))

#define IS_SAI_BLOCK_COMPANDING_MODE(MODE)                                     \
  (((MODE) == SAI_NOCOMPANDING) || ((MODE) == SAI_ULAW_1CPL_COMPANDING) ||     \
   ((MODE) == SAI_ALAW_1CPL_COMPANDING) ||                                     \
   ((MODE) == SAI_ULAW_2CPL_COMPANDING) ||                                     \
   ((MODE) == SAI_ALAW_2CPL_COMPANDING))

#define IS_SAI_BLOCK_FIFO_THRESHOLD(THRESHOLD)                                 \
  (((THRESHOLD) == SAI_FIFOTHRESHOLD_EMPTY) ||                                 \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_1QF) ||                                   \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_HF) ||                                    \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_3QF) ||                                   \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_FULL))

#define IS_SAI_BLOCK_TRISTATE_MANAGEMENT(STATE)                                \
  (((STATE) == SAI_OUTPUT_NOTRELEASED) || ((STATE) == SAI_OUTPUT_RELEASED))

#define IS_SAI_MONO_STEREO_MODE(MODE)                                          \
  (((MODE) == SAI_MONOMODE) || ((MODE) == SAI_STEREOMODE))

#define IS_SAI_SLOT_ACTIVE(ACTIVE) ((ACTIVE) <= SAI_SLOTACTIVE_ALL)

#define IS_SAI_BLOCK_SLOT_NUMBER(NUMBER) ((1U <= (NUMBER)) && ((NUMBER) <= 16U))

#define IS_SAI_BLOCK_SLOT_SIZE(SIZE)                                           \
  (((SIZE) == SAI_SLOTSIZE_DATASIZE) || ((SIZE) == SAI_SLOTSIZE_16B) ||        \
   ((SIZE) == SAI_SLOTSIZE_32B))

#define IS_SAI_BLOCK_FIRSTBIT_OFFSET(OFFSET) ((OFFSET) <= 24U)

#define IS_SAI_BLOCK_FS_OFFSET(OFFSET)                                         \
  (((OFFSET) == SAI_FS_FIRSTBIT) || ((OFFSET) == SAI_FS_BEFOREFIRSTBIT))

#define IS_SAI_BLOCK_FS_POLARITY(POLARITY)                                     \
  (((POLARITY) == SAI_FS_ACTIVE_LOW) || ((POLARITY) == SAI_FS_ACTIVE_HIGH))

#define IS_SAI_BLOCK_FS_DEFINITION(DEFINITION)                                 \
  (((DEFINITION) == SAI_FS_STARTFRAME) ||                                      \
   ((DEFINITION) == SAI_FS_CHANNEL_IDENTIFICATION))

#define IS_SAI_BLOCK_MASTER_DIVIDER(DIVIDER) ((DIVIDER) <= 63U)

#define IS_SAI_BLOCK_FRAME_LENGTH(LENGTH)                                      \
  ((8U <= (LENGTH)) && ((LENGTH) <= 256U))

#define IS_SAI_BLOCK_ACTIVE_FRAME(LENGTH)                                      \
  ((1U <= (LENGTH)) && ((LENGTH) <= 128U))

typedef struct {
  int32_t (*Init)(void *, void *);
  int32_t (*DeInit)(void *);
  int32_t (*ReadID)(void *, uint32_t *);
  int32_t (*Play)(void *);
  int32_t (*Pause)(void *);
  int32_t (*Resume)(void *);
  int32_t (*Stop)(void *, uint32_t);
  int32_t (*SetFrequency)(void *, uint32_t);
  int32_t (*GetFrequency)(void *);
  int32_t (*SetVolume)(void *, uint32_t, uint8_t);
  int32_t (*GetVolume)(void *, uint32_t, uint8_t *);
  int32_t (*SetMute)(void *, uint32_t);
  int32_t (*SetOutputMode)(void *, uint32_t);
  int32_t (*SetResolution)(void *, uint32_t);
  int32_t (*GetResolution)(void *, uint32_t *);
  int32_t (*SetProtocol)(void *, uint32_t);
  int32_t (*GetProtocol)(void *, uint32_t *);
  int32_t (*Reset)(void *);
} AUDIO_Drv_t;

SAI_HandleTypeDef SaiHandle;
DMA_HandleTypeDef hSaiDma;
static AUDIO_Drv_t *AudioDrv = NULL;
void *AudioCompObj;

void Initialize_Audio()
{
    return;
}
